Repository: yarkovaleksei/passgen
Catalog: locale/*/LC_MESSAGES/passgen.po
Languages: ru_ru

source: Option %s must be a number!
ru_ru: Аргумент должен быть числом!

source: One of the arguments %s is mandatory
ru_ru: Один из аргументов %s надо указать обязательно

source: Console password generator
ru_ru: Консольный генератор паролей

source: Default values
ru_ru: Параметры по-умолчанию

source: Default password length
ru_ru: Длина пароля по-умолчанию

source: Usage keys
ru_ru: Используемые ключи

source: Help information
ru_ru: Справочная информация

source: Package version
ru_ru: Номер версии релиза

source: Password length. If not specified,
ru_ru: Длина пароля. Если не указан, то

source: it will be set to default value. If set to 0,
ru_ru: он будет установлен в значение по-умолчанию. Если указать 0,

source: the program will ask for input from the keyboard.
ru_ru: то программа запросит ввод с клавиатуры.

source: The amount for one time passwords.
ru_ru: Количество паролей за один вызов программы.

source: It is useful when you need to create
ru_ru: Полезно, когда надо сгенерировать

source: a file with a unique string.
ru_ru: файл с уникальными строками.

source: A string containing the possible
ru_ru: Строка, содержащая возможные

source: characters in the password.
ru_ru: символы для генерации пароля.

source: If the key is specified, the keys
ru_ru: Если ключ указан, то ключи

source: will be ignored.
ru_ru: будут проигнорированы.

source: Use uppercase letters in the password
ru_ru: Использовать английские буквы в верхнем регистре

source: Use lowercase letters in the password
ru_ru: Использовать английские буквы в нижнем регистре

source: Use the numbers in the password
ru_ru: Использовать цифры

source: Use punctuation to the password
ru_ru: Использовать символы и знаки препинания

source: Add space to the password pattern
ru_ru: Добавить пробел в шаблон пароля

source: Example
ru_ru: Примеры использования

source: Input length from the keyboard and use uppercase letters only
ru_ru: Ввести длину пароля с клавиатуры и использовать только английские буквы в верхнем регистре

source: Use the lowercase letters only
ru_ru: Использовать только английские буквы в нижнем регистре

source: Use punctuation marks only
ru_ru: Использовать только символы и знаки препинания

source: Use lowercase letters and numbers only
ru_ru: Использовать только английские буквы в нижнем регистре и цифры

source: Use lowercase and uppercase letters only
ru_ru: Использовать только английские буквы в нижнем и верхнем регистре

source: Use symbols '123abc' only
ru_ru: Использовать только перечисленные символы: '123abc'

source: Use symbols '123abc' with space
ru_ru: Использовать только перечисленные символы: '123abc' и пробел

source: List of the 5 passwords, one per line
ru_ru: Список из 5 паролей, по одному в строке

source: On any errors report to the address
ru_ru: Об ошибках сообщайте по адресу

source: Get more information on project page
ru_ru: Больше информации на странице проекта

source: Max password length
ru_ru: Максимальная длина пароля

source: Max password count
ru_ru: Максимальное количество паролей

source: Max pattern length
ru_ru: Максимальная длина шаблона

source: No use key %s with long pattern
ru_ru: Не используйте ключ %s с длинным шаблоном

source: Type in a password length. Use only 4 first symbols.
ru_ru: Укажите длину пароля. Будут использованы первые 4 цифры
