Repository: yarkovaleksei/passgen
Catalog: locale/*/passgen.po
Languages: ru

source: Console password generator
ru: Консольный генератор паролей

source: Default values:
ru: Параметры по-умолчанию:

source: Usage symbols: %s
ru: Используемые символы: %s

source: Password length: %d
ru: Длина пароля: %d

source: Usage keys:
ru: Используемые ключи:

source: -h, --help Help information
ru: -h, --help Справочная информация

source: -v, --version Package version
ru: -v, --version Номер версии релиза

source: -l, --length Password length. If not specified,
ru: -l, --length Длина пароля. Если не указан, то

source: it will be set to 25. If set to 0,
ru: он будет установлен в 25. Если указать 0,

source: the program will ask for input from the keyboard.
ru: то программа запросит ввод с клавиатуры.

source: -c, --count The amount for one time passwords.
ru: -c, --count Количество паролей за один раз.

source: It is useful when you need to create
ru: Полезно, когда надо сгенерировать

source: a file with a unique string.
ru: файл с уникальными строками.

source: -d, --digest Adds the numbers in the password
ru: -d, --digest Добавляет цифры к паролю

source: -s, --symbol Adds punctuation to the password
ru: -s, --symbol Добавляет знаки пунктуации к паролю

source: Example:
ru: Примеры использования:

source: $ %s -l25 # Only English letters in upper and lower case
ru: $ %s -l25 # Только английские буквы в верхнем и нижнем регистре

source: $ %s -l25 -d # Adds the numbers
ru: $ %s -l25 -d # Добавляем цифры

source: $ %s -l25 -s # Adding punctuation marks, but do not use numbers
ru: $ %s -l25 -s # Добавляем знаки пунктуации, но не используем цифры

source: $ %s -l25 -ds # Adding punctuation and numbers
ru: $ %s -l25 -ds # Добавляем знаки пунктуации и цифры

source: Type in a password length
ru: Укажите длину пароля
